---
type: EvaluatedParameter
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# EvaluatedParameter

`Autodesk.Revit.DB.EvaluatedParameter` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AsValueString | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Definition | 2024 | `public InternalDefinition Definition { get ; }` |
| Property | HasValue | 2024 | `public bool HasValue { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | StorageType | 2024 | `public StorageType StorageType { get ; }` |
| Property | Value | 2024 | `public ParameterValue Value { get ; }` |